cv.org
#+TITLE: Anatoliy Bilenko
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="tufte.css" type="text/css" />



* CONTACTS
 - anatoliy.bilenko@gmail.com
 - [[https://www.linkedin.com/in/anatoliy-bilenko-4367055/][linkedin]]
 - Location: Europe

* BACKGROUND
- Linux systems programmer with some experience in Linux kernel;
- Leading and mentoring people;
- Fluent in C/C++, assembly, bash, python, Go;
- Distributed systems;
- Telecommunications and protocols;
- Discrete event simulation;
- Solution-wide performance debugging;
- Statistics, Data mining, Machine Learning, Computer vision, DSP;
- Open source contributor.


* FreedomFI/Nova-Labs -- LEAD SWE, ARCHITECT
* 2022-now

 https://github.com/magma/

 Lead development of Wi-Fi offload solution.
 Involved into develpement of telecom core frameworks such as magma
 designed for enabling experienced users to run own mini-telecom
 operator.

 Software product design, including requirements gathering, use-case
 definition, milestone planning, and integration. Communication of
 technical decisions, development plans to software developers,
 product management.

 - Wi-Fi offload team lead;
 - Designed and implemented smoothless LTE to Wi-Fi offloading;
 - Designed and implemented security workflow for Wi-Fi hotspots,
   including implementation of TrustZone kernel module and trustlet,
   openssl RSA engine;
 - Prototyped inbound roaming feature.

 Technologies: EAP-AKA, EAP-TLS, Passpoint 2.0, Radius, Radsec,
 Diameter, M-TLS, Wi-Fi, sWX, S8, S5, S11, Gx, Gy, OpenWiFi TIP,
 Radiator, Radsecoroxy, OpenWRT, TrustZone, openssl, Open vSwitch,
 OpenFlow, AWS, docker, k8s, HashiCorp vault (CA), YateHSS, C, C++,
 Go, python.


* SEAGATE/XYRATEX -- LEAD SWE, ARCHITECT
* 2011-2022

 Distributed object store. Remote work, globally distributed team.

 https://github.com/Seagate/cortx-motr

 Involved into develpement of distributed object storage system
 designed for great efficiency, massive capacity, and high
 HDD-utilization.

 Technologies: C, asm, python, bash, various cluster hardware, network
               and storage controllers such as Mellanox Connectx-5,
               Seagate Exos X 5U84, Supermicro TR4, PCI busses, HBAs,
               simd.

 - 2020 - 2022: Distributed transaction management team lead (4 engineers);
 - 2019 - 2020: Performance team lead (8-15 engineers);
 - 2018 - 2022: A part of architectural group. Software product
   design, including requirements gathering, use-case definition,
   milestone planning, and integration with complementary
   subsystems. Communication of technical decisions, development plans
   to software developers, team leads, product management.
 - RAID NxPxK library design and implementation;
 - Distributed configuration component implementation;
 - Preemptive locking primitive design and implementation;
 - "Parity-math" component as a part of SNS-repair (from HLD to TESTING);
 - HLD and DLD development of "rpc-layer" component;
 - Misc. tasks from CODE to TESTING like lib improvement, etc;
 - Transaction engine component design and implementation;
 - Designed implementation plan for the transaction engine integration
   (overall work was around ~5k hours);
 - Designed and implemented btree persistent structure;
 - Designed approaches (based on existing but with significant project
   specifics) allowing to increase parallelism level for storage
   structures of transaction engine;
 - Performance tuning and optimization in different contexts: from
   application to system-wide;
 - Page Daemon design and implementation;
 - Designed implementation plan for the Page Daemon component
   integration (an alternative was to rewrite the whole project code
   base);
 - Distributed transaction manager detailed level design (high level
   design was proposed by the architect);
 - Different kinds of library algorithms and improvements mostly
   related to parallel and asynchronous programming (ex:
   parallel_for() implementation, async termination implementation,
   etc);
 - Different kinds of scientific work like system performance modeling
   (queuing theory);
 - Designed and implemented distributed profiler;
 - Designed and lead implementation of the cluster-wide performance
   harness (telemetry).
 - Data/metadata corruption debugging in distributed system.


* VIEWDLE, Kiev -- SENIOR SWE (CV/DSP)
* 2009-2011

 Face detection and recognition engine. VIEWDLE was bought by
 Google/Motorola Mobility.

 Technologies: C++, matlab, opencl, opencv, intel tbb, sse, neon, linux.


* LUXOFT, Odessa --  SENIOR EMBEDDED ENGINEER
* 2007-2009

 Emergency Call controller.

 Technologies: C++, RTOS, VME, QNX.


* LUXOFT, Odessa -- SWE
* 2006-2007

  Graphical rasterizer library.

  Technologies: C++, RTOS, VME, QNX.

* HARDWARE PROJECTS
* 2002-2006

- This part of CV does not include precise and full list of completed
  projects;
- Hardware-related experience mostly in airspace and
  telecommunication;
- Software and hardware for sensors and actuators, digital engine
  control systems, telemetry systems in airspace domain.
- Software and hardware components for telephone station switch.

  Technologies: AVR, LPC2100, ATSAM4LC4C, MPC555, Altera Cyclone IV
  EP4CE6, Xilinx Spartan 3E XC3S500E, PCB manufacturing.

* PUBLICATIONS
- US PATENT · [[https://patents.google.com/patent/US20230035666A1][US390999147]] · ANOMALY DETECTION IN STORAGE SYSTEMS · Issued Feb 2, 2023;
- US PATENT · [[https://patents.google.com/patent/US11442715B1/en?inventor=Anatolii+Bilenko][US11442715B1]] · ASYNCHRONOUS FRAMEWORK · Issued Sep 13, 2022;
- PUBLICATION · [[https://scholar.google.com/citations?view_op=view_citation&hl=th&user=j5r-Y28AAAAJ&citation_for_view=j5r-Y28AAAAJ:Y0pCki6q_DkC][GRAPH PARTITIONING METHODS FOR COMPUTATIONS IN RECONFIGURABLE SYSTEMS]] · Issued 2012;
- For full list of publications follow to [[https://scholar.google.com/citations?user=j5r-Y28AAAAJ&hl=th][Google Scholar]] or PhD thesis [[https://github.com/just-now/cv/blob/main/aref.pdf][annotation]].

* EDUCATION
 - Odessa National Polytechnic University, 2001 - 2007, Master of
   Science in EECS. GPA: 98/100. Thesis: "Classification of wavelet
   functions";
 - Odessa National Polytechnic University, 2008 - 2013,
   PhD in EECS. [[https://github.com/just-now/cv/blob/main/aref.pdf][Thesis]]: "Methods of performance increase in reconfigurable
   computing systems by means of new algorithmic and structural
   organization".
* COMMUNITY
- [[https://www.youtube.com/watch?v=FFTi2XNFb7A][Seagate | Meet the Architect – CORTX Observability with Anatoily Bilenko]];
- [[https://www.youtube.com/watch?v=ujyIsCt6bbM][Seagate | Meet the Architect – CORTX DTM: Resiliency in Distributed Systems]];
- Provided lectures on "Processor design" and "[[https://github.com/just-now/slisp/][Compiler design]]" read
  in Odessa National Polytechnic University, 2009-2015, 2021-2023.
  My role: volunteer, leader, organizer.
