cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-27 Thu 14:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Anatoliy Bilenko</title>
<meta name="author" content="anatoliy" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Anatoliy Bilenko</h1>



<div id="outline-container-org28e988c" class="outline-2">
<h2 id="org28e988c">CONTACTS</h2>
<div class="outline-text-2" id="text-org28e988c">
<ul class="org-ul">
<li>anatoliy.bilenko@gmail.com</li>
<li><a href="https://www.linkedin.com/in/anatoliy-bilenko-4367055/">linkedin</a></li>
<li>Location: Europe</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdc4ba5" class="outline-2">
<h2 id="orgcdc4ba5">BACKGROUND</h2>
<div class="outline-text-2" id="text-orgcdc4ba5">
<ul class="org-ul">
<li>Linux systems programmer with some experience in Linux kernel;</li>
<li>Leading and mentoring people;</li>
<li>Fluent in C/C++, assembly, bash, python, Go;</li>
<li>Distributed systems;</li>
<li>Telecommunications and protocols;</li>
<li>Discrete event simulation;</li>
<li>Solution-wide performance debugging;</li>
<li>Statistics, Data mining, Machine Learning, Computer vision, DSP;</li>
<li>Open source contributor.</li>
</ul>
</div>
</div>


<div id="outline-container-orgf2a7ecc" class="outline-2">
<h2 id="orgf2a7ecc">FreedomFI/Nova-Labs &#x2013; LEAD SWE, ARCHITECT</h2>
</div>
<div id="outline-container-org43d1920" class="outline-2">
<h2 id="org43d1920">2022-now</h2>
<div class="outline-text-2" id="text-org43d1920">
<p>
<a href="https://github.com/magma/">https://github.com/magma/</a>
</p>

<p>
Lead development of Wi-Fi offload solution.
Involved into develpement of telecom core frameworks such as magma
designed for enabling experienced users to run own mini-telecom
operator.
</p>

<p>
Software product design, including requirements gathering, use-case
definition, milestone planning, and integration. Communication of
technical decisions, development plans to software developers,
product management.
</p>

<ul class="org-ul">
<li>Wi-Fi offload team lead;</li>
<li>Designed and implemented smoothless LTE to Wi-Fi offloading;</li>
<li>Designed and implemented security workflow for Wi-Fi hotspots,
including implementation of TrustZone kernel module and trustlet,
openssl RSA engine;</li>
<li>Prototyped inbound roaming feature.</li>
</ul>

<p>
Technologies: EAP-AKA, EAP-TLS, Passpoint 2.0, Radius, Radsec,
Diameter, M-TLS, Wi-Fi, sWX, S8, S5, S11, Gx, Gy, OpenWiFi TIP,
Radiator, Radsecoroxy, OpenWRT, TrustZone, openssl, Open vSwitch,
OpenFlow, AWS, docker, k8s, HashiCorp vault (CA), YateHSS, C, C++,
Go, python.
</p>
</div>
</div>


<div id="outline-container-orge0e1e7f" class="outline-2">
<h2 id="orge0e1e7f">SEAGATE/XYRATEX &#x2013; LEAD SWE, ARCHITECT</h2>
</div>
<div id="outline-container-orgcdcd51b" class="outline-2">
<h2 id="orgcdcd51b">2011-2022</h2>
<div class="outline-text-2" id="text-orgcdcd51b">
<p>
Distributed object store. Remote work, globally distributed team.
</p>

<p>
<a href="https://github.com/Seagate/cortx-motr">https://github.com/Seagate/cortx-motr</a>
</p>

<p>
Involved into develpement of distributed object storage system
designed for great efficiency, massive capacity, and high
HDD-utilization.
</p>

<p>
Technologies: C, asm, python, bash, various cluster hardware, network
	      and storage controllers such as Mellanox Connectx-5,
	      Seagate Exos X 5U84, Supermicro TR4, PCI busses, HBAs,
	      simd.
</p>

<ul class="org-ul">
<li>2020 - 2022: Distributed transaction management team lead (4 engineers);</li>
<li>2019 - 2020: Performance team lead (8-15 engineers);</li>
<li>2018 - 2022: A part of architectural group. Software product
design, including requirements gathering, use-case definition,
milestone planning, and integration with complementary
subsystems. Communication of technical decisions, development plans
to software developers, team leads, product management.</li>
<li>RAID NxPxK library design and implementation;</li>
<li>Distributed configuration component implementation;</li>
<li>Preemptive locking primitive design and implementation;</li>
<li>"Parity-math" component as a part of SNS-repair (from HLD to TESTING);</li>
<li>HLD and DLD development of "rpc-layer" component;</li>
<li>Misc. tasks from CODE to TESTING like lib improvement, etc;</li>
<li>Transaction engine component design and implementation;</li>
<li>Designed implementation plan for the transaction engine integration
(overall work was around ~5k hours);</li>
<li>Designed and implemented btree persistent structure;</li>
<li>Designed approaches (based on existing but with significant project
specifics) allowing to increase parallelism level for storage
structures of transaction engine;</li>
<li>Performance tuning and optimization in different contexts: from
application to system-wide;</li>
<li>Page Daemon design and implementation;</li>
<li>Designed implementation plan for the Page Daemon component
integration (an alternative was to rewrite the whole project code
base);</li>
<li>Distributed transaction manager detailed level design (high level
design was proposed by the architect);</li>
<li>Different kinds of library algorithms and improvements mostly
related to parallel and asynchronous programming (ex:
parallel_for() implementation, async termination implementation,
etc);</li>
<li>Different kinds of scientific work like system performance modeling
(queuing theory);</li>
<li>Designed and implemented distributed profiler;</li>
<li>Designed and lead implementation of the cluster-wide performance
harness (telemetry).</li>
<li>Data/metadata corruption debugging in distributed system.</li>
</ul>
</div>
</div>


<div id="outline-container-org8d3b069" class="outline-2">
<h2 id="org8d3b069">VIEWDLE, Kiev &#x2013; SENIOR SWE (CV/DSP)</h2>
</div>
<div id="outline-container-orgdb74ea5" class="outline-2">
<h2 id="orgdb74ea5">2009-2011</h2>
<div class="outline-text-2" id="text-orgdb74ea5">
<p>
Face detection and recognition engine. VIEWDLE was bought by
Google/Motorola Mobility.
</p>

<p>
Technologies: C++, matlab, opencl, opencv, intel tbb, sse, neon, linux.
</p>
</div>
</div>


<div id="outline-container-orgaae59d5" class="outline-2">
<h2 id="orgaae59d5">LUXOFT, Odessa &#x2013;  SENIOR EMBEDDED ENGINEER</h2>
</div>
<div id="outline-container-org9528462" class="outline-2">
<h2 id="org9528462">2007-2009</h2>
<div class="outline-text-2" id="text-org9528462">
<p>
Emergency Call controller.
</p>

<p>
Technologies: C++, RTOS, VME, QNX.
</p>
</div>
</div>


<div id="outline-container-org7586705" class="outline-2">
<h2 id="org7586705">LUXOFT, Odessa &#x2013; SWE</h2>
</div>
<div id="outline-container-orgaf5767e" class="outline-2">
<h2 id="orgaf5767e">2006-2007</h2>
<div class="outline-text-2" id="text-orgaf5767e">
<p>
Graphical rasterizer library.
</p>

<p>
Technologies: C++, RTOS, VME, QNX.
</p>
</div>
</div>

<div id="outline-container-org6f5b2f3" class="outline-2">
<h2 id="org6f5b2f3">HARDWARE PROJECTS</h2>
</div>
<div id="outline-container-orgf4ef56a" class="outline-2">
<h2 id="orgf4ef56a">2002-2006</h2>
<div class="outline-text-2" id="text-orgf4ef56a">
<ul class="org-ul">
<li>This part of CV does not include precise and full list of completed
projects;</li>
<li>Hardware-related experience mostly in airspace and
telecommunication;</li>
<li>Software and hardware for sensors and actuators, digital engine
control systems, telemetry systems in airspace domain.</li>
<li><p>
Software and hardware components for telephone station switch.
</p>

<p>
Technologies: AVR, LPC2100, ATSAM4LC4C, MPC555, Altera Cyclone IV
EP4CE6, Xilinx Spartan 3E XC3S500E, PCB manufacturing.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orga82d6a0" class="outline-2">
<h2 id="orga82d6a0">PUBLICATIONS</h2>
<div class="outline-text-2" id="text-orga82d6a0">
<ul class="org-ul">
<li>US PATENT · <a href="https://patents.google.com/patent/US20230035666A1">US390999147</a> · ANOMALY DETECTION IN STORAGE SYSTEMS · Issued Feb 2, 2023;</li>
<li>US PATENT · <a href="https://patents.google.com/patent/US11442715B1/en?inventor=Anatolii+Bilenko">US11442715B1</a> · ASYNCHRONOUS FRAMEWORK · Issued Sep 13, 2022;</li>
<li>PUBLICATION · <a href="https://scholar.google.com/citations?view_op=view_citation&amp;hl=th&amp;user=j5r-Y28AAAAJ&amp;citation_for_view=j5r-Y28AAAAJ:Y0pCki6q_DkC">GRAPH PARTITIONING METHODS FOR COMPUTATIONS IN RECONFIGURABLE SYSTEMS</a> · Issued 2012;</li>
<li>For full list of publications follow to <a href="https://scholar.google.com/citations?user=j5r-Y28AAAAJ&amp;hl=th">Google Scholar</a> or PhD thesis <a href="https://github.com/just-now/cv/blob/main/aref.pdf">annotation</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3375bee" class="outline-2">
<h2 id="org3375bee">EDUCATION</h2>
<div class="outline-text-2" id="text-org3375bee">
<ul class="org-ul">
<li>Odessa National Polytechnic University, 2001 - 2007, Master of
Science in EECS. GPA: 98/100. Thesis: "Classification of wavelet
functions";</li>
<li>Odessa National Polytechnic University, 2008 - 2013,
PhD in EECS. <a href="https://github.com/just-now/cv/blob/main/aref.pdf">Thesis</a>: "Methods of performance increase in reconfigurable
computing systems by means of new algorithmic and structural
organization".</li>
</ul>
</div>
</div>
<div id="outline-container-org92a4fde" class="outline-2">
<h2 id="org92a4fde">COMMUNITY</h2>
<div class="outline-text-2" id="text-org92a4fde">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=FFTi2XNFb7A">Seagate | Meet the Architect – CORTX Observability with Anatoily Bilenko</a>;</li>
<li><a href="https://www.youtube.com/watch?v=ujyIsCt6bbM">Seagate | Meet the Architect – CORTX DTM: Resiliency in Distributed Systems</a>;</li>
<li>Provided lectures on "Processor design" and "<a href="https://github.com/just-now/slisp/">Compiler design</a>" read
in Odessa National Polytechnic University, 2009-2015, 2021-2023.
My role: volunteer, leader, organizer.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
